In [1]:
import pandas as pd

df = pd.read_csv('./data/sf-salaries.csv')

/tmp/ipykernel_5407/1628983626.py:3: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('./data/sf-salaries.csv')

In [2]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [30]:
cols = list(df.columns)

coldict = {}
pos = 0

for i in cols:
    coldict[pos] = i
    pos += 1

# print(df['Benefits'])

In [62]:

df2 = pd.to_numeric(df["Benefits"], errors = 'coerce').fillna(0)
# print(df2['Benefits'])

# df2["Benefits"]

df['Benefits'] = df2
mx = df['TotalPay'].max()
print(f"max value = {mx}")

max value = 567595.43

In [76]:
df3 = df[df['TotalPay']== df['TotalPay'].max()]

print(type(df3))

print(df3.loc([:,'Id','EmployeeName']))

SyntaxError: invalid syntax (993521388.py, line 5)

In [78]:
adult  = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", names = ['age','workclass','fnlwgt', 'education',    'education_num','marital_status','occupation','relationship','race','sex','capital_gain','capital_loss', 'hours_per_week', 'native_country','label'], index_col = False)

In [87]:
# adult.describe()

print(f"Shape of data {adult.shape}")
adult.head()
adult.info()

Shape of data (32561, 15)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  label           32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [93]:
adult.index.name = 'adult_idx'
adult.sample(100)
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'label'],
      dtype='object')

In [94]:
adult.index

RangeIndex(start=0, stop=32561, step=1, name='adult_idx')

In [108]:
adult.loc[2,['AGE']]

AGE    38
Name: 2, dtype: object

In [109]:
adult.columns = (adult.columns.str.lower())

In [114]:
adult.loc[2,[x.lower() for x in adult.columns]]

age                               38
workclass                    Private
fnlwgt                        215646
education                    HS-grad
education_num                      9
marital_status              Divorced
occupation         Handlers-cleaners
relationship           Not-in-family
race                           White
sex                             Male
capital_gain                       0
capital_loss                       0
hours_per_week                    40
native_country         United-States
label                          <=50K
Name: 2, dtype: object

In [120]:
lcols = list(map(lambda x:x.lower(), list(adult.columns)))

In [146]:
# adult['label1'] = 
adult['label1'] = [x.strip() for x in adult['label'].values]

# adult.head()

adult[adult['label1'] == '>50K']

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,label,label1
adult_idx,,,,,,,,,,,,,,,,
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K,>50K
10,37,Private,280464,Some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K,>50K
11,30,State-gov,141297,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K,>50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32539,71,?,287372,Doctorate,16,Married-civ-spouse,?,Husband,White,Male,0,0,10,United-States,>50K,>50K
32545,39,Local-gov,111499,Assoc-acdm,12,Married-civ-spouse,Adm-clerical,Wife,White,Female,0,0,20,United-States,>50K,>50K
32554,53,Private,321865,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,>50K,>50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K,>50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K,>50K

In [150]:
pd.crosstab(adult.sex, adult.label1) 
# select sex, count(*) from adult
# group by sex

ObjectNotExecutableError: Not an executable object: 'select sex, label1 from adult'

In [158]:
from sklearn.datasets import load_iris
import pandas as pd
from pandasql import sqldf
from pandasql import load_meat, load_births
import re

births = load_births()
meat = load_meat()
iris = load_iris()
iris_df = pd.DataFrame(iris.data, columns=iris.feature_names)
iris_df['species'] = pd.Categorical.from_codes(iris.target, iris.target_names)
iris_df.columns = [re.sub("[() ]", "", col) for col in iris_df.columns]

o = sqldf("SELECT * FROM iris_df LIMIT 10;", locals())
o1 = sqldf("SELECT sepalwidthcm, species FROM iris_df LIMIT 10;", locals())

ObjectNotExecutableError: Not an executable object: 'SELECT * FROM iris_df LIMIT 10;'

In [161]:
import pandasql
sqldf = lambda q: pandasql.sqldf(q, globals())
adult.head(2)
query = "select count(*) from data"

sqldf(query)

ObjectNotExecutableError: Not an executable object: 'select count(*) from data'